#include <stdio.h>
#include <graphics.h>
#include <stdlib.h>

int score = 0;	//分数
int rank = 0;		//等级

#define BLOCK_COUNT		5
#define BLOCK_WIDTH		5
#define BLOCK_HEIGHT	5

int block[BLOCK_COUNT * 4][BLOCK_HEIGHT][BLOCK_WIDTH] = {
	// "|" 形方块
	{	//向上
		0,0,0,0,0,
		0,0,1,0,0,
		0,0,1,0,0,
		0,0,1,0,0,
		0,0,0,0,0
	},

	{	//向右
		0,0,0,0,0,
		0,0,0,0,0,
		0,1,1,1,0,
		0,0,0,0,0,
		0,0,0,0,0
	},

	{	//向下
		0,0,0,0,0,
		0,0,1,0,0,
		0,0,1,0,0,
		0,0,1,0,0,
		0,0,0,0,0
	},

	{	//向左
		0,0,0,0,0,
		0,0,0,0,0,
		0,1,1,1,0,
		0,0,0,0,0,
		0,0,0,0,0
	},

	// "L" 型方块
	{
		0,0,0,0,0,
		0,0,1,0,0,
		0,0,1,0,0,
		0,0,1,1,0,
		0,0,0,0,0
	},

	{ 
		0,0,0,0,0,
		0,0,0,0,0,
		0,1,1,1,0,
		0,1,0,0,0,
		0,0,0,0,0 
	},

	{ 
		0,0,0,0,0,
		0,1,1,0,0,
		0,0,1,0,0,
		0,0,1,0,0,
		0,0,0,0,0 
	},

	{ 
		0,0,0,0,0,
		0,0,0,1,0,
		0,1,1,1,0,
		0,0,0,0,0,
		0,0,0,0,0 
	},

	// "田" 形方块
	{ 
		0,0,0,0,0,
		0,1,1,0,0,
		0,1,1,0,0,
		0,0,0,0,0,
		0,0,0,0,0 
	},

	{ 
		0,0,0,0,0,
		0,1,1,0,0,
		0,1,1,0,0,
		0,0,0,0,0,
		0,0,0,0,0 
	},

	{ 
		0,0,0,0,0,
		0,1,1,0,0,
		0,1,1,0,0,
		0,0,0,0,0,
		0,0,0,0,0 
	},

	{
		0,0,0,0,0,
		0,1,1,0,0,
		0,1,1,0,0,
		0,0,0,0,0,
		0,0,0,0,0 
	},

	// "T" 形方块
	{ 
		0,0,0,0,0,
		0,1,1,1,0,
		0,0,1,0,0,
		0,0,0,0,0,
		0,0,0,0,0
	},

	{ 
		0,0,0,0,0,
		0,0,0,1,0,
		0,0,1,1,0,
		0,0,0,1,0,
		0,0,0,0,0 
	},

	{ 
		0,0,0,0,0,
		0,0,1,0,0,
		0,1,1,1,0,
		0,0,0,0,0,
		0,0,0,0,0 
	},

	{ 
		0,0,0,0,0,
		0,1,0,0,0,
		0,1,1,0,0,
		0,1,0,0,0,
		0,0,0,0,0 
	},

	// "Z" 形方块
	{
		0,0,0,0,0,
		0,1,1,0,0,
		0,0,1,1,0,
		0,0,0,0,0,
		0,0,0,0,0 
	},

	{ 
		0,0,0,0,0,
		0,0,1,0,0,
		0,1,1,0,0,
		0,1,0,0,0,
		0,0,0,0,0 
	},

	{ 
		0,0,0,0,0,
		0,1,1,0,0,
		0,0,1,1,0,
		0,0,0,0,0,
		0,0,0,0,0 
	},

	{ 
		0,0,0,0,0,
		0,0,1,0,0,
		0,1,1,0,0,
		0,1,0,0,0,
		0,0,0,0,0 
	}
};

void welcome(void) {
	initgraph(550, 660);
	HWND window = GetHWnd();		//获取窗口
	SetWindowText(window, _T("俄罗斯方块    老杨"));		//设置窗口标题

	//设置文本的	字体样式
	settextstyle(40, 0, _T("微软雅黑"));
	setcolor(WHITE);
	outtextxy(205, 200, _T("俄罗斯方块! "));
	settextstyle(20, 0, _T("楷体"));
	outtextxy(175, 300, _T("编程, 从俄罗斯方块开始! "));
	Sleep(3000);	//睡眠 (暂停) 3000毫秒, 3秒钟
}

//初始化游戏场景
void initGameScene(void) {
	char str[16];

	//清除屏幕
	cleardevice();
	//initgraph(550, 660);
	//HWND	window = GetHWnd();
	//SetWindowText(window, _T("俄罗斯方块    老杨"));

	setlinecolor(WHITE);
	rectangle(27, 27, 336, 635);
	rectangle(29, 29, 334, 633);
	rectangle(370, 50, 515, 195);

	settextstyle(24, 0, _T("楷体"));
	settextcolor(LIGHTGRAY);
	outtextxy(405, 215, _T("下一个: "));

	settextcolor(RED);
	outtextxy(405, 280, _T("分数: "));
	sprintf_s(str, "%d", score);
	outtextxy(415, 310, str);

	outtextxy(405, 375, _T("等级: "));
	sprintf_s(str, "%d", rank);
	outtextxy(425, 405, str);

	//操作说明	↑	↓	←	  →
	settextcolor(LIGHTBLUE);
	outtextxy(390, 475, _T("操作说明: "));
	outtextxy(390, 500, _T("↑: 旋转"));
	outtextxy(390, 525, _T("↓: 下降"));
	outtextxy(390, 550, _T("←: 左移"));
	outtextxy(390, 575, _T("→: 右移"));
	outtextxy(390, 600, _T("空格: 暂停"));
}

void nextBlock(void) {

}

int main(void) {
	welcome();
	initGameScene();

	//产生新方块
	nextBlock();

	system("pause");
	closegraph();
	return 0;
}